{
  "": "oops",
  "hero_title": "From Indie to Industry",
  "hero_subtitle": "how YouTube went from a hobbyist heaven to a corporate paradise",
  "hero_byline": "Jan Juraszek, Danael Robert-Nicoud, Ender Sari, Kalan Walmsley, Veronika Wannack ",
  "youtube_url": "https://www.youtube.com/embed/39ORolk1P0I",
  "transcript_btn_show": "Show Transcript",
  "transcript_btn_hide": "Hide Transcript",
  "transcript_content": "Hey guys, Jimmy here, welcome to my first YouTube video. I'm going to be very famous and get a lot of money from this, but I don't know how to yet. But hey, check this out, I found this really cool site, where apparently, they offer a course, on how to make a living off YouTube. It's quite expensive but at least you do save the one dollar. So um I definitely want to do this, let's check it out... Let's see what happens",
  "intro_action": "Jimmy purchases a course on how to be a world class YouTuber... Little does he know, he will also ... (TODO)",
  "prologue_chat_1": "[jimmy] Hey! What's up? My name's Jimmy and I want to become a world-class <a href=\"https://www.urbandictionary.com/define.php?term=Youtuber\" target=\"_blank\"><i>YouTuber</i></a>! I just published my first video, check it out...",
  "prologue_chat_2": "[jimmy] Pretty cool right?! I emailed some companies to ask them to <b>sponsor me</b>, but the only one that bothered replying just sent me <q>😂🤮</q>. I don't get it... This course I bought promised to make me a YouTube millionaire overnight... Oh, cool, and they even have a chat function where <b>I can talk to some experts.</b>  ",
  "interlude_1": "5 minutes later...",
  "intro_chat_1": "[eddie] Wow... a real customer?",
  "intro_chat_2": "[jimmy] I just spent $999\\$$ on your course with my mom's credit card. 😁",
  "intro_chat_3": "[kaleb] ...",
  "intro_chat_4": "[jimmy] Will you promise to help me make a lot of money on YouTube?",
  "intro_chat_5": "[daniel] Maybe.",
  "intro_chat_6": "[jimmy] ...I'm getting a refund.",
  "intro_chat_7": "[vivian] Wait! What we CAN promise is to show you <b>how YouTube grew, how creators turned their hobbies into real careers, and how sponsorships affect engagement and the trajectory of the channel.</b> We have real data to prove it! <b>Let me introduce you to the datasets we used:</b>",
  "datasets_title": "The YouNiverse and SponsorBlock Datasets",
  "datasets_subtitle": "Manoel Horta Ribeiro and Robert West (YouNiverse), Ajay Ramachandran (SponsorBlock)",
  "datasets_overview": "The YouNiverse dataset, produced by the ADA lab at EPFL, provides a large-scale overview of the English-language YouTube ecosystem. It incorporates <b>metadata</b> for more than <b>72.9 million videos</b> published on the platform between May <b>2005</b> and October <b>2019</b>. In addition, it includes weekly channel-level <b>time series</b> spanning January 2015 to September 2019 for 153,550 channels, totaling 18,872,499 observations. While YouNiverse also includes other aspects (such as comment-related data), this project relies exclusively on the metadata and channel time-series elements. <br> <br> Given the focus of the analysis on <b>professionalism and sponsorship practices on YouTube</b>, the SponsorBlock database is paired with YouNiverse. SponsorBlock is an open-source browser extension enabling users to automatically skip chosen types of segments on YouTube videos (preview, credits, sponsor segments, ...) and it is crowdsourced: users submit the start and end times of these segments. For this project, only the <b>sponsor segment</b> category is selected, thus including only videos with paid promotional content for a brand or product. <br> <br> Together, these two datasets complement each other well. YouNiverse gives a broad view of YouTube (video- and channel-wise, evolution over time), while SponsorBlock adds sponsorship insights at the single-video scale. Their combination forms the central foundation for the analysis.",
  "datasets_plots_intro": "Below are two plots providing better insights into the relationships between these two datasets:",
  "datasets_plots_comments": "The <b>left plot</b> considers <b>all types of segments</b> from SponsorBlock. Apart from the earliest years (roughly up to 2010), the </b>proportion</b> of YouNiverse videos that appeared in SponsorBlock remained <b>approximately constant over time</b>. This is interesting: while the annual volume of YouTube uploads grew strongly, the annual number of videos added to SponsorBlock appears to have grown with the same trend. <br> The <b>right plot</b> is restricted to <b>in-video sponsor segments</b>. Here the pattern is completely different: the <b>fraction rose steeply</b> from around 2015 onward, indicating that sponsors in particular seemed to be skyrocketing, making them interesting to analyse. In 2019, almost $0.25\\%$ of the videos from YouNiverse were labelled as containing a sponsor segment, a non-negligible amount given the sheer size of the YouNiverse dataset (and also keeping in mind that in practice, only a subset of all videos actually include sponsorship segments).",
  "dataset_chat_1": "[jimmy] Okay, fine. You know what you are doing. <b>So how do I make money?</b>",
  "dataset_chat_2": "[kaleb] To know that we know what we know, and that we do not know what we do not know, that is true knowledge...",
  "dataset_chat_3": "[jimmy] ...",
  "dataset_chat_4": "[eddie] Ignore that.",
  "dataset_chat_5": "[daniel] He's trying to say that in order to master something, you need to first understand it. We have researched several questions, just for you, about what the data tell us.",
  "learn_title": "What You'll Learn",
  "learn_subtitle": "Click any question to jump to that section",
  "q1_title": "How have channels evolved from indie to professional?",
  "q1_desc": "",
  "q2_title": "What enabled indie channels to become professional-minded?",
  "q2_desc": "",
  "q3_title": "How does a focus on professionalism affect engagement?",
  "q3_desc": "",
  "section1_why_jimmy": "[jimmy] I'm seriously thinking about becoming a YouTuber. I see people making a living from it, but everyone keeps telling me I'm too late 😔",
  "section1_why_ender": "[eddie] That depends on how you look at YouTube. Before money or tactics, let's <b>zoom out</b> and see how the platform actually <b>evolved</b>, category by category.",
  "section1_title": "How have channels evolved from indie to professional?",
  "section1_intro": "In 2008, YouTube saw only a few hundred thousand uploads a year. By 2018, that number had exploded past 15 million. As the platform filled with videos, some categories surged while others grew more steadily, tracing YouTube's shift from indie-scale creation to industry-scale content production.",
  "section1_intro2": "Not all YouTube categories evolved in the same way. While total uploads increased dramatically across the platform, individual categories followed distinct growth trajectories. Some scaled explosively, others expanded steadily, and a few remained relatively niche.",
  "section1_chat_1": "[jimmy] Okay, so there are way more videos now... but <b>categories clearly behave differently.</b>",
  "section1_chat_2": "[eddie] Right. With such scaling, it's no wonder that channels started <i>diversifying</i>.",
  "section1_chat_3": "[jimmy] Diversifying?",
  "section1_chat_4": "[eddie] Professionally-minded creators started building infrastructure around their videos, rather than simply clicking upload.",
  "section1_text_1": "As channels <b>professionalized</b>, creators began to rely on more than just videos themselves. One clear signal of this shift appears in <b>video descriptions</b>. We extract <b>URLs</b> from descriptions and grouped them into three functional types: <b>monetization links</b>, which point to revenue sources (<i>e.g.</i> <code>skl.sh</code>, <code>amazon.com</code>, <code>patreon.com</code>); <b>social links</b>, which connect creators to off-platform audiences (<i>e.g.</i> <code>twitter.com</code>, <code>instagram.com</code>, <code>facebook.com</code>); and <b>content links</b>, which promote channels or other videos within YouTube (<i>e.g.</i> links to <code>youtube.com</code> channels or videos). The chart below tracks the share of uploads containing each link type over time. From 2008 to 2018, all three become increasingly common across YouTube, reflecting a <b>platform-wide shift toward more professional publishing practices</b>.",
  "section1_chat_5": "[jimmy] So writing video descriptions became... mandatory?",
  "section1_chat_6": "[eddie] Optional in theory. Essential in practice.",
  "section1_chat_7": "[jimmy] Okay, but what were creators actually doing with all those links?",
  "section1_chat_8": "[eddie] Different things in different categories. And they did not all adopt them at the same speed.",
  "section1_text_3": "Monetization links show the <b>most uneven adoption across categories</b>. In a typical year, <b>Gaming</b> and <b>Howto & Style</b> include monetization links in around $16\\%$ of uploads, while <b>News & Politics</b> and <b>Nonprofits & Activism</b> remain closer to $4\\%$. When weighted by upload volume, pooled shares exceed $20\\%$ in <b>Gaming</b> and stay in single digits for the lowest categories. This indicates that <b>monetization practices spread later and more unevenly</b> across YouTube.",
  "section1_text_4": "Content links appear <b>earlier</b> and spread <b>more evenly</b>. In a typical year, leading categories reach the low to mid $30\\%$ range, while even <b>lower intensity categories exceed</b> $10\\%$. When weighted by volume, pooled shares often cluster between $40\\%$ and $50\\%$. This suggests that linking to other videos or channels became a broadly shared way to organize viewing and retain attention.",
  "section1_text_5": "Social links grow <b>fastest</b> and reach the <b>highest levels overall</b>. In a typical year, <b>Gaming exceeds $40\\%$</b>, with <b>Entertainment</b> and <b>Music</b> at similar levels. When weighted by volume, pooled shares approach $60\\%$ in Gaming and exceed $40\\%$ in several other categories. This may reflect a widespread shift toward building audiences beyond a single video.",
  "section1_text_6": "Taken together, these patterns describe a <b>clear progression in link usage over time</b>. Creators first adopted links to organize viewing and retain attention, followed by widespread use of social links to build audiences beyond a single video, while <b>monetization links remain more selective</b>. Video descriptions evolve from optional text into a functional component of professional publishing across YouTube categories, even though <b>this progression unfolds within ecosystems of very different sizes</b>.",
  "section1_chat_9": "[jimmy] I get the pattern, but not the consequences. I need to compare categories to understand what that really means.",
  "section1_chat_10": "[eddie] Exactly. The same pattern can mean very different things at different scales.",
  "section1_chat_11": "[jimmy] Okay. Time to put two categories next to each other.",
  "section1_chat_12": "[eddie] Exactly...",
  "section1_chat_13": "[jimmy] I compared all 105 category pairs. Yeah... I understand that channels didn't turn professional overnight. They built structure around the video, piece by piece, with different categories professionalizing at different speeds.",
  "section1_chat_14": "[eddie] No overnight success. Just a lot of nights 😉",
  "section2_title": "What enabled indie channels to become professional-minded?",
  "section2_chat_1": "[jimmy] Okay but <b>how long is this going to take?!</b> My mom is already wondering why her card is being declined.",
  "section2_chat_2": "[kaleb] <q><i>All human wisdom is contained in these two words &mdash; wait and hope.</i></q>",
  "section2_chat_3": "[jimmy] ...",
  "section2_chat_4": "[kaleb] It's Dumas... Anyway, I hate to break it to you, but you might be waiting <b>a while</b>.",
  "section2_text_1": "Note the logarithmic $x$ axes. The right plot seems to follow a log-normal distribtion, whereas the left plot obtained $\\lambda = 0.429\\pm 0.017$ with a <a href=\"https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.boxcox.html\" target=\"_blank\">Box-Cox transformation</a>, suggesting it is gamma-like. The log-normal nature of the <b>right plot</b> suggests that the <b>random effects</b> affecting the number of videos could be <b>multiplicative</b> (compared to <i>e.g.</i> additive). For the <b>left plot</b>, gamma-like distributions are often used to model <b>waiting times</b>. The time before your first sponsorship is indeed a <b>waiting process</b>, and the left plot suggests that it can be statistically modelled as such.",
  "section2_chat_5": "[kaleb] The median time between posting your first video and obtaining your first sponsor is <b>1108 days</b> or around <b>3 years!</b> It also takes a median of <b>148 videos!</b>",
  "section2_chat_6": "[jimmy] Three years!!! I want to throw up. 🤢 But <b>what kind of stats do I need to get my first sponsor?</b> Maybe if I buy enough bot accounts...",
  "section2_chat_7": "[kaleb] Ever heard of the sunk cost fallacy? A story for another day maybe. The metrics your channel will likely need to reach before your first sponsor <b>depend on the category</b> of videos you want to make. How about you pick one?",
  "section2_chat_8": "[jimmy] Maybe <b><cat>?</b>",
  "section2_chat_9": "[kaleb] <joke> On median, you would need a total of around <b><views> views</b>, <b><subs> subscribers</b>, and <b><vids> videos</b>. In comparison, the medians of the distributions over all categories are <b><gen_views> views</b>, <b><gen_subs> subscribers</b>, and <b><gen_vids> videos</b>.",
  "section2_text_2_introduction": "In these plots, you can see the distributions of how much time passes and how many videos get uploaded before you can expect your first sponsor.",
  "section2_text_2": "Note the logarithmic $x$ axes for all plots, and the logarithmic $y$ axis for activity. All distributions seem to be log-normal, apart from activity which seems to follow a power law. As mentioned above, <b>log-normal distributions</b> suggest <b>many small multiplicative effects</b> affect the metric. These would for example be <b>timing, algorithmic exposure, audience availability, content quality</b>, <i>etc</i>. The <b>activity distribution</b> suggests there is <b>no typical median upload rate at sponsorship time</b>. It could also suggest <b>burst-like behaviour</b>, in which creators would publish more videos at once but only rarely.",
  "section2_chat_10": "[jimmy] I still don't know what to pick... And the longer I take to decide, the closer I get to having to explain a 1k transfer to <q><i>sheNaNigans incoporated</i></q>. Aargh! <b>Do I really have to choose a category right away? Or can I pick a category that makes 💲💲mad cash💲💲, and once I have my sponsors, I can switch to what I am actually interested in?</b>",
  "section2_chat_11": "[kaleb] Interesting strategy... Switching categories does happen but only quite rarely. Let's look at <b>category transitions</b> between <b>before and after the first sponsor</b>.",
  "section2_text_3_introduction": "Here, we see that some YouTubers decide to pivot categories after becoming sponsored. ",
  "section2_text_3": "If we look at the <b>6 months before</b> the first sponsor and the <b>6 months after</b>, and we compare the most common video category in each period, we get a sense of <b>what kind of transitions people make</b>. Note the sizes of the connections are logarithmic.",
  "section2_chat_12": "[kaleb] I know you won't like this, but you may be able to pay your mom back over a longer period of time &mdash; like an investment! Except instead of asking the bank for a loan you went straight to the vault.",
  "section2_chat_13": "[jimmy] I don't know... How sustainable could it really be? <b>Do YouTubers that get sponsored stay active, or do they abandon their channels?</b>",
  "section2_chat_14": "[kaleb] <b>It's more sustainable than you might think!</b> Look at the proportions of channels still active in 2025. The YouNiverse dataset only goes until 2019, so these data had to be collected using the <a href=\"https://developers.google.com/youtube/v3\" target=\"_blank\">YouTube API</a>.",
  "section2_chat_15": "[eddie] Yeah, the data was a real pain to get. I have so many API keys now...🗝️ Check out how many activites are still active in the plot below!  ",
  "section2_chat_16": "[kaleb] For the next plot, you can choose to look at <b>all channels</b> or <b>compare sponsored and non-sponsored</b> channels!",
  "section2_activity2_text": "This view shows channel activity in November 2025 for ~136K YouTube channels from YouNiverse. Channels are considered active if they uploaded at least once in 2025. Each icon represents about 200 channels, enabling comparison of channel counts across categories while keeping both large and small categories readable. Hovering reveals activity status and subscriber counts for 2019 and 2025, and clicking opens the channel’s YouTube page.",
  "section2_api_observations": "<b>Across ~136K channels, only about $58.3\\%$ are active in 2025</b>, which means YouTube's growth comes with substantial churn. The biggest ecosystems (Music, Entertainment, Gaming, People & Blogs) are huge, but they sit near <b>$51\\%$-$59\\%$ active</b>, suggesting that scale often reflects <b>many entrants and many dropouts</b>, not stability. In contrast, several smaller categories show much higher persistence &mdash; <b>News & Politics ($72.4\\%$), Travel & Events ($71.4\\%$), Autos & Vehicles ($71.3\\%$), and Education ($68.9\\%$)</b> &mdash; indicating that professionalization can be as much about <b>staying power</b> as popularity. <b>Nonprofits & Activism is the outlier</b> with only <b>$33.3\\%$ active</b>, highlighting that not every creator ecosystem sustains long-term production equally.",
  "section2_text_4": "Notice how the sponsored channels seem to consistently be more active in 2025 than the non-sponsored ones? We can test this using a paired t-test between categories. The results show a significant ($p < 0.01$) $16.12\\%$ difference in activity! Whether this is <i>caused</i> by obtaining a sponsorship is a different question though...",
  "section2_chat_18": "[jimmy] So you <i>can</i> make YouTube your job!",
  "section2_chat_19": "[kaleb] That's not what I...",
  "section2_chat_20": "[jimmy] I need to start right away! Tell me <b>which sponsors pay the most?</b>",
  "section2_chat_21": "[kaleb] Oof, that's a tough one... We don't really have the data on that. Although, we could look at <b>which sponsors interact with which channels!</b>",
  "section2_chat_22": "[jimmy] How do you know who sponsored a channel though?",
  "section2_chat_23": "[kaleb] Good question! The short answer is <i>painfully</i>. You know how we mentioned earlier that video descriptions can contain URLs? Well we can look at those. However, a huge proportion of those URLs are <i>shortened</i>. URL shortening is when you use a service like <a href=\"https://bit.ly\" target=\"_blank\">bit.ly</a> to make a URL shorter. Here comes the hard part: there is absolutely no way to figure out the link a shortened URL points to without pinging the shortener service.",
  "section2_chat_24": "[jimmy] Wow that sounds evil... How did you do it then?",
  "section2_chat_25": "[kaleb] Since we weren't going to hack the shortening services to steal their hashing algorithms, we had to use clever brute force. To minimise the amount of data we were requesting, we used <code>HEAD</code> requests with a \"no redirect\" policy. This meant that in the <code>HEAD</code> response header, we could extract the address the shortened link immediately redirected to. Since making thousands of requests a second looked suspicious, we used an exponential backoff strategy. This worked by waiting a random, exponentially increasing amount of time between failed requests. That way, it would eventually wait long enough to reset any rate limits. We also ran multiple HTTP clients in parallel and tried proxy rotation...",
  "section2_chat_26": "[jimmy] Okay I get it &mdash; it was a bad time. That was the last hurdle right?",
  "section2_chat_27": "[vivian] We wish! Having the full URLs is great, but we don't know which ones are linked to monetisation yet. Think about it, people put all sorts of links in their descriptions: WikiPedia articles, social media profiles, personal websites... The list goes on!",
  "section2_chat_28": "[jimmy] But then how did you figure it out? There must be millions of links!",
  "section2_chat_29": "[vivian] We tried a bunch of different strategies. The one we ended up going for was to use the GPT-5 nano model with a handful of manual examples to classify the URLs as monetised or not.",
  "section2_chat_30": "[jimmy] Then were you fine?!",
  "section2_chat_31": "[kaleb] Yes! Checkout the graph below. It's on a separate page because it runs preformance intense <a href=\"https://webassembly.org/\" target=\"_blank\">WebAssembly</a>.",
  "section2_text_5": "Let's take channels <i>A</i>, <i>B</i>, and <i>C</i>. Let's say that <i>A</i> is sponsored by sponsors $\\alpha$ and $\\beta$, <i>B</i> by $\\alpha$, $\\beta$, and $\\gamma$, and <i>C</i> by $\\gamma$. Then <i>A</i> and <i>B</i> would have a connection of weight 2 between them and <i>B</i> and <i>C</i> a connection of weight 1. <i>A</i> and <i>C</i> would have no connection. Using this, we can build a graph. <br> Notice you can toggle different colourmaps. <i>Connectivity</i> shows how many neighbours each node has (logarithmic scale), <i>Category</i> shows the channel category, <i>Subscriber</i> and <i>Videos</i> show the number of subscribers and videos (logarithmic scale), and <i>Activity</i> shows channels active in 2025 in blue, others in red. The most interesting colourmap is <i>Leiden</i>, which shows different community assignments by the <a href=\"https://en.wikipedia.org/wiki/Leiden_algorithm\" target=\"_blank\">Leiden algorithm</a>. In short, it is a community detection algorithm that optimises the modularity of the graph.",
  "section2_chat_32": "[kaleb] Pretty cool right?",
  "section2_chat_33": "[jimmy] Hypnotising 😵‍💫 But <b>what do the Leiden algorithm communities mean?</b> Right now they're just colourful dots for me.",
  "section2_chat_34": "[kaleb] Great question! We can look at the <b>top 5 most connected channels</b> and the <b>top 10 most common URLs</b> to try to gain some insights. Which one do you want to look at?",
  "section2_text_6": "A much more in-depth analysis could be done on these communities and the graph in general. However we can still see the outlines of <b>certain groups of channels that are bound together by their sponsors</b>. Each community seems to tend towards certain <b>global themes</b> or present <b>similarities between channels</b>.",
  "section2_chat_35": "[jimmy] Hey I know some of those guys!",
  "section3_title": "How does a focus on professionalism affect engagement?",
  "section3_chat_1": "[jimmy] Thanks for all these explanations, but can I know <b>what will happen once I get my first sponsor?</b>",
  "section3_chat_2": "[daniel] Ok, then <b>let's study the relationship between sponsorship and engagement!</b> I bet you would like to know what to expect after you enter the world of sponsorship 😁",
  "section3_chat_3": "[jimmy] Sure! Will my YouTube stats skyrocket?!",
  "section3_chat_4": "[daniel] Take a chill pill! Don't forget that <b>establishing causation is very hard</b>, thus my goal is to analyze and show you the observed patterns and propose plausible interpretations.",
  "section3_chat_5": "[jimmy] Ok, I'm listening carefully then...",
  "section3_dumbbell_intro": "First, some characteristics of sponsored vs. non-sponsored videos are compared within channels that have sponsors (restricting to channels with at least 5 sponsored videos in SponsorBlock, so it is representative). In the plot, for each category, video status (sponsored or not), and metric of interest (for example, video duration), <b>the median per channel is first computed</b>. Then, <b>the median of these channel-wise medians is taken</b> to obtain the values displayed. This procedure ensures that each channel has the same weight (even if some channels have many more videos than others) and that the final values can be interpreted as \"typical\" at the channel level.",
  "section3_dumbbell_analysis": "First of all, the <b>like/dislike ratio</b> is defined as $\\frac{\\text{like\\_count}}{\\text{like\\_count} + \\text{dislike\\_count}} \\cdot 100$, to get a comprehensive measure of viewer satisfaction (percentage of likes among all feedback). Notice the values for News & Politics compared to the other categories. No surprise: this is a more delicate, polarizing topic... Apart from that, <b>sponsored videos tend to reach a higher percentage of likes in most categories</b>. This is quite interesting: even though the viewer is interrupted in the video (usually considered annoying), the higher budgets of sponsored videos may translate into better production quality, which viewers appreciate. All values in the plot are above 95.5%, meaning that the median viewer satisfaction is very high overall.",
  "section3_dumbbell_conclusion": "Next, the focus moves to <b>video duration and view counts</b> (the different data is displayed by toggling the buttons above the plot). Without exception, <b>sponsored videos are, on average, longer and more viewed than non-sponsored ones</b>. Again, a plausible explanation is that sponsored videos have higher production means, leading to more polished content that attracts more viewers. Taken together, <b>these results suggest a higher audience engagement for sponsored videos</b>.",
  "section3_delta_intro": "However, at this stage, <b>jumping to conclusions would be premature</b>, as it is also informative to examine how some metrics evolve around the first-ever sponsor appearance in a channel (turning point where a channel actually becomes labeled as sponsored). For this, the <b>number of weeks relative to the first sponsor appearance</b> is used (26 weeks before and after, to cover a full year). Two metrics are compared: <b>delta_views and delta_subs</b>, defined as the week-to-week differences in views and subscribers for each channel. Because channels display vastly different sizes, the logarithm of these differences is taken, then averaged for each relative week.",
  "section3_delta_analysis": "On these plots (that can be toggled using the buttons), a steady increase in delta_views and delta_subs is visible before the first sponsor, indicating that <b>channels are already in a growth phase before they attract sponsorship</b>. Moreover, the confidence intervals are quite narrow, suggesting stable and reliable mean estimates.",
  "section3_delta_views": "In the <b>views</b> plot, the week-to-week change in views increases as the first sponsor approaches (we can even see a jump at this first appearance), but a week after that point, the rate of change becomes slower than before (the slope is smaller).",
  "section3_delta_subs": "For <b>subscribers</b> (note the change in the y-axis scale!), this pattern is even clearer. Here, the week-to-week gain in subscribers also increases as the first sponsor approaches (same with the observed jump), but then stabilizes to an approximately constant value. This indicates that channels continue to gain subscribers over time, but the rate of increase no longer rises as it did in the weeks leading up to the first sponsor.",
  "section3_chat_6": "[daniel] Let's summarize the results: Your channel will probably need to <b>already be in a steady growth phase before introducing its first sponsor</b>. Even though sponsored videos are likely to be longer in duration, attract more views, and receive positive audience feedback overall, there will probably be a <b>short period of strong growth in the channel</b> around the time of your first sponsor, but <b>followed by a slowdown in the growth rate</b> (for both views and subscribers). ",
  "section3_chat_7": "[jimmy] Oh well, not entirely positive then...",
  "section3_chat_8": "[daniel] Hey, look at the bright side! More money will be flowing in! 🤑💵",
  "team_title": "Meet the REAL Team",
  "team_subtitle": "The people behind this project",
  "team_1_name": "Ender",
  "team_1_role": "Ecosystem Explorer",
  "team_1_avatar": "ender.gif",
  "team_1_desc": "aka Eddie, expert on question #1",
  "team_2_name": "Kalan",
  "team_2_role": "Resident Rustacian",
  "team_2_avatar": "kalan.gif",
  "team_2_desc": "aka Kaleb, expert on question #2",
  "team_3_name": "Danael",
  "team_3_role": "Engagement Explorer",
  "team_3_avatar": "danael.gif",
  "team_3_desc": "aka Daniel, expert on question #3",
  "team_4_name": "Veronika",
  "team_4_role": "website wizard",
  "team_4_avatar": "veronika.gif",
  "team_4_desc": "likes to snack",
  "team_5_name": "Jan",
  "team_5_role": "yappy youtuber",
  "team_5_avatar": "jan.gif",
  "team_5_desc": "our loyal customer",
  "team_6_name": "Siba",
  "team_6_role": "Amazing Assistant",
  "team_6_avatar": "siba.gif",
  "team_6_desc": "Thanks for your support!!!!",
  "dialogue_jimmy_hint": "Let me pick a category..."
}